ci4/app/Controllers/Artikel.php

SELECT *
FROM `artikel`
---
    public function admin_index()
    {
        $title = 'Admin Portal Berita';
        $model = new ArtikelModel();

        try {
            $artikel = $model->findAll();