ci4/app/Controllers/Artikel.php

    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $q = $this->request->getVar('q') ?? '';
        $model = new ArtikelModel();

        try {
            $artikel = $model->like('judul', $q)->paginate(10);
---
SELECT *
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'

    public function edit($id)
    {
        $artikel = new ArtikelModel();

        $validation = \Config\Services::validation();
        $validation->setRules([
            'judul' => 'required',
        ]);

        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid) {
            try {
                $artikel->update($id, [
                    'judul' => $this->request->getPost('judul'),
                    'isi'   => $this->request->getPost('isi'),
                    'slug'  => url_title($this->request->getPost('judul'), '-', true),
                ]);
            } catch (DatabaseException $e) {
                // Jika database belum terset, tetap tampilkan form tanpa crash.
            }

            return redirect()->to('/admin/artikel');
        }

        try {
            $data = $artikel->where('id', $id)->first();
---
SELECT *
FROM `artikel`
WHERE `id` = '1'
 LIMIT 1